import course from "../models/course";
import subject from "../models/subject";
import User from "../models/user";

export const COURSE = [
    new course("0", "HUMAN INTERFACE DESIGN", "หลักการออกแบบโดยอาศัยผู้ใช้เป็นศูนย์กลาง ปัจจัยที่เกี่ยวกับมนุษย์และหลักการทางจิตวิทยาสำหรับการออกแบบส่วนต่อประสานกับผู้ใช้ เทคโนโลยีในการต่อประสานระหว่างมนุษย์และเครื่อง แบบจำลองการปฏิสัมพันธ์ รูปแบบของการปฏิสัมพันธ์ ขอบเขตของการออกแบบการเชื่อมต่อกับผู้ใช้และการออกแบบประสบการณ์ในการใช้งาน กระบวนการในการออกแบบการเชื่อมต่อกับผู้ใช้ เครื่องมือในการออกแบบ หลักการและข้อควรปฏิบัติในการออกแบบ เทคนิคการประเมิน การออกแบบการเชื่อมต่อกับผู้ใช้บนระบบปฏิบัติการสมัยใหม่และอุปกรณ์คอมพิวเตอร์พกพาได้แบบต่าง ๆ"),
    new course("1", "SERVICE-ORIENTED PROGRAMMING", ""),
    new course("2", "REQUIREMENT ENGINEERING", ""),
    new course("3", "MOBILE DEVICE PROGRAMMING", ""),
  ];
export const Subject = [
    new subject("0", "สมชาย", "งานที่1",'0'),
    new subject("1", "สมชาย", "งานที่2",'0'),
    new subject("2", "สมชาย", "งานที่1", '2'),
    new subject("3", "สมชาย", "งานที่2", '2'),
  ];